sterentev/atdf-device-asm-include/inc/ATmega64C1.inc
; ----------	Register CANGSTA bits		------------------------
.equ	OVFG		= 6		; 0x40 - Overload Frame Flag
.equ	TXBSY		= 4		; 0x10 - Transmitter Busy
.equ	RXBSY		= 3		; 0x08 - Receiver Busy
.equ	ENFG		= 2		; 0x04 - Enable Flag
.equ	BOFF		= 1		; 0x02 - Bus Off Mode
.equ	ERRP		= 0		; 0x01 - Error Passive Mode

; ----------	Register CANGIT bits		------------------------
.equ	CANIT		= 7		; 0x80 - General Interrupt Flag
.equ	BOFFIT		= 6		; 0x40 - Bus Off Interrupt Flag
.equ	OVRTIM		= 5		; 0x20 - Overrun CAN Timer Flag
.equ	BXOK		= 4		; 0x10 - Burst Receive Interrupt Flag
.equ	SERG		= 3		; 0x08 - Stuff Error General Flag
.equ	CERG		= 2		; 0x04 - CRC Error General Flag
.equ	FERG		= 1		; 0x02 - Form Error General Flag
.equ	AERG		= 0		; 0x01 - Acknowledgement Error General Flag

; ----------	Register CANGIE bits		------------------------
.equ	ENIT		= 7		; 0x80 - Enable all Interrupts
.equ	ENBOFF		= 6		; 0x40 - Enable Bus Off Interrupt
.equ	ENRX		= 5		; 0x20 - Enable Receive Interrupt
.equ	ENTX		= 4		; 0x10 - Enable Transmit Interrupt
.equ	ENERR		= 3		; 0x08 - Enable MOb Error Interrupt
.equ	ENBX		= 2		; 0x04 - Enable Burst Receive Interrupt
.equ	ENERG		= 1		; 0x02 - Enable General Error Interrupt
.equ	ENOVRT		= 0		; 0x01 - Enable CAN Timer Overrun Interrupt

; ----------	Register CANEN2 bits		------------------------
.equ	ENMOB_MASK	= 0x3F		;      - Enable MObs (6 bits)
.equ	ENMOB0		= 0		;          ENMOB BIT0 position

; ----------	Register CANIE2 bits		------------------------
.equ	IEMOB_MASK	= 0x3F		;      - Interrupt Enable  MObs (6 bits)
.equ	IEMOB0		= 0		;          IEMOB BIT0 position

; ----------	Register CANSIT2 bits		------------------------
.equ	SIT_MASK	= 0x3F		;      - Status of Interrupt MObs (6 bits)
.equ	SIT0		= 0		;          SIT BIT0 position

; ----------	Register CANBT1 bits		------------------------
.equ	BRP_MASK	= 0x7E		;      - Baud Rate Prescaler bits (6 bits)
.equ	BRP0		= 1		;          BRP BIT0 position

; ----------	Register CANBT2 bits		------------------------
.equ	SJW_MASK	= 0x60		;      - Re-Sync Jump Width bits (2 bits)
.equ	SJW0		= 5		;          SJW BIT0 position
.equ	PRS_MASK	= 0x0E		;      - Propagation Time Segment bits (3 bits)
.equ	PRS0		= 1		;          PRS BIT0 position

; ----------	Register CANBT3 bits		------------------------
.equ	PHS2_MASK	= 0x70		;      - Phase Segment 2 bits (3 bits)
.equ	PHS20		= 4		;          PHS2 BIT0 position
.equ	PHS1_MASK	= 0x0E		;      - Phase Segment 1 bits (3 bits)
.equ	PHS10		= 1		;          PHS1 BIT0 position
.equ	SMP		= 0		; 0x01 - Sample Type

; ----------	Register CANHPMOB bits		------------------------
.equ	HPMOB_MASK	= 0xF0		;      - Highest Priority MOb Number bits (4 bits)
.equ	HPMOB0		= 4		;          HPMOB BIT0 position
.equ	CGP_MASK	= 0x0F		;      - CAN General Purpose bits (4 bits)
.equ	CGP0		= 0		;          CGP BIT0 position

; ----------	Register CANPAGE bits		------------------------
.equ	MOBNB_MASK	= 0xF0		;      - MOb Number bits (4 bits)
.equ	MOBNB0		= 4		;          MOBNB BIT0 position
.equ	AINC		= 3		; 0x08 - MOb Data Buffer Auto Increment (Active Low)
.equ	INDX_MASK	= 0x07		;      - Data Buffer Index bits (3 bits)
.equ	INDX0		= 0		;          INDX BIT0 position

; ----------	Register CANSTMOB bits		------------------------
.equ	DLCW		= 7		; 0x80 - Data Length Code Warning on MOb
.equ	TXOK		= 6		; 0x40 - Transmit OK on MOb
.equ	RXOK		= 5		; 0x20 - Receive OK on MOb
.equ	BERR		= 4		; 0x10 - Bit Error on MOb
.equ	SERR		= 3		; 0x08 - Stuff Error on MOb
.equ	CERR		= 2		; 0x04 - CRC Error on MOb
.equ	FERR		= 1		; 0x02 - Form Error on MOb
.equ	AERR		= 0		; 0x01 - Acknowledgement Error on MOb

; ----------	Register CANCDMOB bits		------------------------
.equ	CONMOB_MASK	= 0xC0		;      - MOb Config bits (2 bits)
.equ	CONMOB0		= 6		;          CONMOB BIT0 position
.equ	RPLV		= 5		; 0x20 - Reply Valid
.equ	IDE		= 4		; 0x10 - Identifier Extension
.equ	DLC_MASK	= 0x0F		;      - Data Length Code bits (4 bits)
.equ	DLC0		= 0		;          DLC BIT0 position

; ----------	Register CANIDT4 bits		------------------------
.equ	IDT_MASK	= 0xF8		;      -  (5 bits)
.equ	IDT0		= 3		;          IDT BIT0 position
.equ	RTRTAG		= 2		; 0x04 - 
.equ	RB1TAG		= 1		; 0x02 - 
.equ	RB0TAG		= 0		; 0x01 - 



; ====	AC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register AC0CON bits		------------------------
.equ	AC0EN		= 7		; 0x80 - Analog Comparator 0 Enable Bit
.equ	AC0IE		= 6		; 0x40 - Analog Comparator 0 Interrupt Enable Bit
.equ	AC0IS_MASK	= 0x30		;      - Analog Comparator 0  Interrupt Select Bits (2 bits)
.equ	AC0IS0		= 4		;          AC0IS BIT0 position
.equ	ACCKSEL		= 3		; 0x08 - Analog Comparator Clock Select
.equ	AC0M_MASK	= 0x07		;      - Analog Comparator 0 Multiplexer Register (3 bits)
.equ	AC0M0		= 0		;          AC0M BIT0 position

; ----------	Register AC1CON bits		------------------------
.equ	AC1EN		= 7		; 0x80 - Analog Comparator 1 Enable Bit
.equ	AC1IE		= 6		; 0x40 - Analog Comparator 1 Interrupt Enable Bit
.equ	AC1IS_MASK	= 0x30		;      - Analog Comparator 1  Interrupt Select Bit (2 bits)
.equ	AC1IS0		= 4		;          AC1IS BIT0 position
.equ	AC1ICE		= 3		; 0x08 - Analog Comparator 1 Interrupt Capture Enable Bit
.equ	AC1M_MASK	= 0x07		;      - Analog Comparator 1 Multiplexer Register (3 bits)
.equ	AC1M0		= 0		;          AC1M BIT0 position
; ::::  AC1IS	:::: bitfield values
;			0x00		; Interrupt on Toggle
;			0x10		; Reserved
;			0x20		; Interrupt on Falling Edge
;			0x30		; Interrupt on Rising Edge

; ----------	Register AC2CON bits		------------------------
.equ	AC2EN		= 7		; 0x80 - Analog Comparator 2 Enable Bit
.equ	AC2IE		= 6		; 0x40 - Analog Comparator 2 Interrupt Enable Bit
.equ	AC2IS_MASK	= 0x30		;      - Analog Comparator 2  Interrupt Select Bit (2 bits)
.equ	AC2IS0		= 4		;          AC2IS BIT0 position
.equ	AC2M_MASK	= 0x07		;      - Analog Comparator 2 Multiplexer Register (3 bits)
.equ	AC2M0		= 0		;          AC2M BIT0 position
; ::::  AC2IS	:::: bitfield values
;			0x00		; Interrupt on Toggle
;			0x10		; Reserved
;			0x20		; Interrupt on Falling Edge
;			0x30		; Interrupt on Rising Edge

; ----------	Register AC3CON bits		------------------------
.equ	AC3EN		= 7		; 0x80 - Analog Comparator 3 Enable Bit
.equ	AC3IE		= 6		; 0x40 - Analog Comparator 3 Interrupt Enable Bit
.equ	AC3IS_MASK	= 0x30		;      - Analog Comparator 3  Interrupt Select Bit (2 bits)
.equ	AC3IS0		= 4		;          AC3IS BIT0 position
.equ	AC3M_MASK	= 0x07		;      - Analog Comparator 3 Multiplexer Register (3 bits)
.equ	AC3M0		= 0		;          AC3M BIT0 position
; ::::  AC3IS	:::: bitfield values
;			0x00		; Interrupt on Toggle
;			0x10		; Reserved
;			0x20		; Interrupt on Falling Edge
;			0x30		; Interrupt on Rising Edge

; ----------	Register ACSR bits		------------------------
.equ	AC3IF		= 7		; 0x80 - Analog Comparator 3 Interrupt Flag Bit
.equ	AC2IF		= 6		; 0x40 - Analog Comparator 2 Interrupt Flag Bit
.equ	AC1IF		= 5		; 0x20 - Analog Comparator 1  Interrupt Flag Bit
.equ	AC0IF		= 4		; 0x10 - Analog Comparator 0 Interrupt Flag Bit
.equ	AC3O		= 3		; 0x08 - Analog Comparator 3 Output Bit
.equ	AC2O		= 2		; 0x04 - Analog Comparator 2 Output Bit
.equ	AC1O		= 1		; 0x02 - Analog Comparator 1 Output Bit
.equ	AC0O		= 0		; 0x01 - Analog Comparator 0 Output Bit



; ====	DAC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register DACH bits		------------------------
.equ	DACH_MASK	= 0xFF		;      - DAC Data Register High Byte Bits (8 bits)
.equ	DACH0		= 0		;          DACH BIT0 position

; ----------	Register DACL bits		------------------------
.equ	DACL_MASK	= 0xFF		;      - DAC Data Register Low Byte Bits (8 bits)
.equ	DACL0		= 0		;          DACL BIT0 position

; ----------	Register DACON bits		------------------------
.equ	DAATE		= 7		; 0x80 - DAC Auto Trigger Enable Bit
.equ	DATS_MASK	= 0x70		;      - DAC Trigger Selection Bits (3 bits)
.equ	DATS0		= 4		;          DATS BIT0 position
.equ	DALA		= 2		; 0x04 - DAC Left Adjust
.equ	DAEN		= 0		; 0x01 - DAC Enable Bit
; ::::  DATS	:::: bitfield values
;			0x00		; Analog Comparator 0
;			0x10		; Analog Comparator 1
;			0x20		; External Interrupt Request 0
;			0x30		; Timer/Counter0 Compare Match A
;			0x40		; Timer/Counter0 Overflow
;			0x50		; Timer/Counter1 Compare Match B
;			0x60		; Timer/Counter1 Overflow
;			0x70		; Timer/Counter1 Capture Event



; ====	CPU MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SPMCSR bits		------------------------
.equ	SPMIE		= 7		; 0x80 - SPM Interrupt Enable
.equ	RWWSB		= 6		; 0x40 - Read While Write Section Busy
.equ	SIGRD		= 5		; 0x20 - Signature Row Read
.equ	RWWSRE		= 4		; 0x10 - Read While Write section read enable
.equ	BLBSET		= 3		; 0x08 - Boot Lock Bit Set
.equ	PGWRT		= 2		; 0x04 - Page Write
.equ	PGERS		= 1		; 0x02 - Page Erase
.equ	SPMEN		= 0		; 0x01 - Store Program Memory Enable

; ----------	Register SREG bits		------------------------
.equ	SREG_I		= 7		; 0x80 - Global Interrupt Enable
.equ	SREG_T		= 6		; 0x40 - Bit Copy Storage
.equ	SREG_H		= 5		; 0x20 - Half Carry Flag
.equ	SREG_S		= 4		; 0x10 - Sign Bit
.equ	SREG_V		= 3		; 0x08 - Two's Complement Overflow Flag
.equ	SREG_N		= 2		; 0x04 - Negative Flag
.equ	SREG_Z		= 1		; 0x02 - Zero Flag
.equ	SREG_C		= 0		; 0x01 - Carry Flag

; ----------	Register MCUCR bits		------------------------
.equ	SPIPS		= 7		; 0x80 - SPI Pin Select
.equ	PUD		= 4		; 0x10 - Pull-up disable
.equ	IVSEL		= 1		; 0x02 - Interrupt Vector Select
.equ	IVCE		= 0		; 0x01 - Interrupt Vector Change Enable

